Model: "auto_encoder_4"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_24 (Conv2D)          (None, 64, 64, 32)        2624      
                                                                 
 max_pooling2d_12 (MaxPooli  (None, 32, 32, 32)        0         
 ng2D)                                                           
                                                                 
 conv2d_25 (Conv2D)          (None, 32, 32, 64)        18496     
                                                                 
 max_pooling2d_13 (MaxPooli  (None, 16, 16, 64)        0         
 ng2D)                                                           
                                                                 
 dropout_12 (Dropout)        (None, 16, 16, 64)        0         
                                                                 
 conv2d_26 (Conv2D)          (None, 16, 16, 128)       73856     
                                                                 
 max_pooling2d_14 (MaxPooli  (None, 8, 8, 128)         0         
 ng2D)                                                           
                                                                 
 flatten_4 (Flatten)         (None, 8192)              0         
                                                                 
 dropout_13 (Dropout)        (None, 8192)              0         
                                                                 
 dense_12 (Dense)            (None, 512)               4194816   
                                                                 
 dropout_14 (Dropout)        (None, 512)               0         
                                                                 
 dense_13 (Dense)            (None, 128)               65664     
                                                                 
 dropout_15 (Dropout)        (None, 128)               0         
                                                                 
 dense_14 (Dense)            (None, 512)               66048     
                                                                 
 reshape_4 (Reshape)         (None, 4, 4, 32)          0         
                                                                 
 up_sampling2d_12 (UpSampli  (None, 8, 8, 32)          0         
 ng2D)                                                           
                                                                 
 conv2d_27 (Conv2D)          (None, 8, 8, 128)         36992     
                                                                 
 dropout_16 (Dropout)        (None, 8, 8, 128)         0         
                                                                 
 up_sampling2d_13 (UpSampli  (None, 16, 16, 128)       0         
 ng2D)                                                           
                                                                 
 conv2d_28 (Conv2D)          (None, 16, 16, 64)        73792     
                                                                 
 dropout_17 (Dropout)        (None, 16, 16, 64)        0         
                                                                 
 up_sampling2d_14 (UpSampli  (None, 32, 32, 64)        0         
 ng2D)                                                           
                                                                 
 conv2d_29 (Conv2D)          (None, 32, 32, 32)        18464     
                                                                 
 conv2d_transpose_4 (Conv2D  (None, 64, 64, 7)         2023      
 Transpose)                                                      
                                                                 
=================================================================
Total params: 4552775 (17.37 MB)
Trainable params: 4552775 (17.37 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

charset_in: AaOoUu8Bj
charset_out: ÄäÖöÜüß
box_size: 64
test_size: 0.1
batch_size: 32
training_loss: [0.033889058977365494, 0.02774093486368656, 0.026222150772809982, 0.025326136499643326, 0.024788351729512215, 0.024303484708070755, 0.023820195347070694, 0.02352791279554367, 0.02323373779654503, 0.02302347496151924, 0.022825434803962708, 0.02262169122695923, 0.02245318330824375, 0.022318106144666672, 0.022181330248713493, 0.022085901349782944, 0.02192862518131733, 0.021842235699295998, 0.0217557605355978, 0.021632647141814232, 0.021536128595471382, 0.02142919786274433, 0.02137107402086258, 0.021305657923221588, 0.021245859563350677, 0.02118876203894615, 0.021074198186397552, 0.02102610655128956, 0.021007349714636803, 0.02092614583671093, 0.020866623148322105, 0.020808974280953407, 0.020773870870471, 0.020712994039058685, 0.020672481507062912, 0.020653842017054558, 0.02061964012682438, 0.020552530884742737, 0.020485172048211098, 0.020461371168494225, 0.02047136053442955, 0.020412541925907135, 0.020374266430735588, 0.020329954102635384, 0.02029363438487053, 0.020242609083652496, 0.020235471427440643, 0.02016548067331314, 0.020173534750938416, 0.02011171355843544]
validation_loss: [0.027439864352345467, 0.0260616522282362, 0.02433852106332779, 0.023835277184844017, 0.02331678569316864, 0.02275175228714943, 0.02257853001356125, 0.022274287417531013, 0.021872209385037422, 0.022004639729857445, 0.021566996350884438, 0.02132732793688774, 0.02126016654074192, 0.02142271213233471, 0.02091214619576931, 0.020933132618665695, 0.020749196410179138, 0.02098779007792473, 0.02104857750236988, 0.02055976167321205, 0.020390966907143593, 0.02043113298714161, 0.020405657589435577, 0.020506594330072403, 0.020228857174515724, 0.020158791914582253, 0.02013278566300869, 0.020357726141810417, 0.020114140585064888, 0.019888829439878464, 0.0198834091424942, 0.019894281402230263, 0.0197877436876297, 0.01995147578418255, 0.01998818852007389, 0.019882185384631157, 0.020205650478601456, 0.01970583014190197, 0.019809095188975334, 0.019846109673380852, 0.019672436639666557, 0.019559381529688835, 0.01975826546549797, 0.019540203735232353, 0.019639745354652405, 0.01962803676724434, 0.019568275660276413, 0.0202426016330719, 0.01973848044872284, 0.019513482227921486]
