Model: "auto_encoder_6"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_36 (Conv2D)          (None, 64, 64, 32)        2624      
                                                                 
 max_pooling2d_18 (MaxPooli  (None, 32, 32, 32)        0         
 ng2D)                                                           
                                                                 
 conv2d_37 (Conv2D)          (None, 32, 32, 64)        18496     
                                                                 
 max_pooling2d_19 (MaxPooli  (None, 16, 16, 64)        0         
 ng2D)                                                           
                                                                 
 dropout_23 (Dropout)        (None, 16, 16, 64)        0         
                                                                 
 conv2d_38 (Conv2D)          (None, 16, 16, 128)       73856     
                                                                 
 max_pooling2d_20 (MaxPooli  (None, 8, 8, 128)         0         
 ng2D)                                                           
                                                                 
 flatten_6 (Flatten)         (None, 8192)              0         
                                                                 
 dropout_24 (Dropout)        (None, 8192)              0         
                                                                 
 dense_18 (Dense)            (None, 512)               4194816   
                                                                 
 dropout_25 (Dropout)        (None, 512)               0         
                                                                 
 dense_19 (Dense)            (None, 128)               65664     
                                                                 
 dropout_26 (Dropout)        multiple                  0 (unused)
                                                                 
 dense_20 (Dense)            (None, 512)               66048     
                                                                 
 reshape_6 (Reshape)         (None, 4, 4, 32)          0         
                                                                 
 up_sampling2d_18 (UpSampli  (None, 8, 8, 32)          0         
 ng2D)                                                           
                                                                 
 conv2d_39 (Conv2D)          (None, 8, 8, 128)         36992     
                                                                 
 dropout_27 (Dropout)        (None, 8, 8, 128)         0         
                                                                 
 up_sampling2d_19 (UpSampli  (None, 16, 16, 128)       0         
 ng2D)                                                           
                                                                 
 conv2d_40 (Conv2D)          (None, 16, 16, 64)        73792     
                                                                 
 dropout_28 (Dropout)        (None, 16, 16, 64)        0         
                                                                 
 up_sampling2d_20 (UpSampli  (None, 32, 32, 64)        0         
 ng2D)                                                           
                                                                 
 conv2d_41 (Conv2D)          (None, 32, 32, 32)        18464     
                                                                 
 conv2d_transpose_6 (Conv2D  (None, 64, 64, 7)         2023      
 Transpose)                                                      
                                                                 
=================================================================
Total params: 4552775 (17.37 MB)
Trainable params: 4552775 (17.37 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

charset_in: AaOoUu8Bj
charset_out: ÄäÖöÜüß
box_size: 64
test_size: 0.1
batch_size: 32
training_loss: [0.03281056135892868, 0.026421064510941505, 0.02480398304760456, 0.023868415504693985, 0.02314605750143528, 0.02265838161110878, 0.022231442853808403, 0.021901214495301247, 0.02162119932472706, 0.021337371319532394, 0.021098697558045387, 0.02094750478863716, 0.020716754719614983, 0.020595159381628036, 0.020487427711486816, 0.020316608250141144, 0.020236235111951828, 0.0200745090842247, 0.019973358139395714, 0.019848542287945747, 0.01976850815117359, 0.01967144012451172, 0.0195956788957119, 0.019465073943138123, 0.01945856586098671, 0.019378356635570526, 0.01930265501141548, 0.0192197747528553, 0.019173579290509224, 0.019136743620038033, 0.019069811329245567, 0.01900543086230755, 0.018953368067741394, 0.018933318555355072, 0.018846580758690834, 0.01882210746407509, 0.018792223185300827, 0.018744269385933876, 0.018698690459132195, 0.018668117001652718, 0.018658332526683807, 0.0185793936252594, 0.018533794209361076, 0.01851760782301426, 0.018481887876987457, 0.01845700293779373, 0.018373684957623482, 0.0184005293995142, 0.018399477005004883, 0.018308334052562714]
validation_loss: [0.026962924748659134, 0.02442222461104393, 0.023424435406923294, 0.022549046203494072, 0.02212623320519924, 0.021599197760224342, 0.021010590717196465, 0.020762849599123, 0.020605036988854408, 0.020608223974704742, 0.020226260647177696, 0.02020546980202198, 0.02011648193001747, 0.020132772624492645, 0.019872574135661125, 0.019688814878463745, 0.01955384574830532, 0.01952911727130413, 0.019496940076351166, 0.019504766911268234, 0.01959432102739811, 0.019248414784669876, 0.019462311640381813, 0.019172975793480873, 0.019063051789999008, 0.019383549690246582, 0.019034987315535545, 0.018826911225914955, 0.019052989780902863, 0.018783245235681534, 0.01890394650399685, 0.01900676265358925, 0.018973857164382935, 0.01875336281955242, 0.018924560397863388, 0.018784046173095703, 0.01883956417441368, 0.018651897087693214, 0.018698539584875107, 0.018689453601837158, 0.018684012815356255, 0.018725018948316574, 0.01864202879369259, 0.018614759668707848, 0.018642645329236984, 0.018623484298586845, 0.018488574773073196, 0.018441980704665184, 0.01859804056584835, 0.01850326545536518]
