Model: "auto_encoder_8"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_48 (Conv2D)          (None, 64, 64, 32)        2624      
                                                                 
 max_pooling2d_24 (MaxPooli  (None, 32, 32, 32)        0         
 ng2D)                                                           
                                                                 
 conv2d_49 (Conv2D)          (None, 32, 32, 64)        18496     
                                                                 
 max_pooling2d_25 (MaxPooli  (None, 16, 16, 64)        0         
 ng2D)                                                           
                                                                 
 dropout_35 (Dropout)        multiple                  0 (unused)
                                                                 
 conv2d_50 (Conv2D)          (None, 16, 16, 128)       73856     
                                                                 
 max_pooling2d_26 (MaxPooli  (None, 8, 8, 128)         0         
 ng2D)                                                           
                                                                 
 flatten_8 (Flatten)         (None, 8192)              0         
                                                                 
 dropout_36 (Dropout)        multiple                  0 (unused)
                                                                 
 dense_24 (Dense)            (None, 512)               4194816   
                                                                 
 dropout_37 (Dropout)        multiple                  0 (unused)
                                                                 
 dense_25 (Dense)            (None, 128)               65664     
                                                                 
 dropout_38 (Dropout)        multiple                  0 (unused)
                                                                 
 dense_26 (Dense)            (None, 512)               66048     
                                                                 
 reshape_8 (Reshape)         (None, 4, 4, 32)          0         
                                                                 
 up_sampling2d_24 (UpSampli  (None, 8, 8, 32)          0         
 ng2D)                                                           
                                                                 
 conv2d_51 (Conv2D)          (None, 8, 8, 128)         36992     
                                                                 
 dropout_39 (Dropout)        multiple                  0 (unused)
                                                                 
 up_sampling2d_25 (UpSampli  (None, 16, 16, 128)       0         
 ng2D)                                                           
                                                                 
 conv2d_52 (Conv2D)          (None, 16, 16, 64)        73792     
                                                                 
 dropout_40 (Dropout)        multiple                  0 (unused)
                                                                 
 up_sampling2d_26 (UpSampli  (None, 32, 32, 64)        0         
 ng2D)                                                           
                                                                 
 conv2d_53 (Conv2D)          (None, 32, 32, 32)        18464     
                                                                 
 conv2d_transpose_8 (Conv2D  (None, 64, 64, 7)         2023      
 Transpose)                                                      
                                                                 
=================================================================
Total params: 4552775 (17.37 MB)
Trainable params: 4552775 (17.37 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

charset_in: AaOoUu8Bj
charset_out: ÄäÖöÜüß
box_size: 64
test_size: 0.1
batch_size: 32
training_loss: [0.03213278576731682, 0.024454256519675255, 0.02229270525276661, 0.020958514884114265, 0.020128687843680382, 0.019517770037055016, 0.019077932462096214, 0.018556393682956696, 0.018204687163233757, 0.01793004758656025, 0.01770210824906826, 0.017417756840586662, 0.017210403457283974, 0.017009666189551353, 0.0168038047850132, 0.01665375381708145, 0.01645037531852722, 0.01633465476334095, 0.01618112064898014, 0.016055699437856674, 0.01588437892496586, 0.015765497460961342, 0.01568731851875782, 0.015631679445505142, 0.015451365150511265, 0.015395510010421276, 0.015299047343432903, 0.015185730531811714, 0.015104127116501331, 0.015024645254015923, 0.01491647120565176, 0.01491611823439598, 0.014787769876420498, 0.014686064794659615, 0.014649436809122562, 0.014572661370038986, 0.014539320021867752, 0.014410275034606457, 0.014350634068250656, 0.014298845082521439, 0.014229336753487587, 0.014203531667590141, 0.014120564796030521, 0.014060065150260925, 0.013993615284562111, 0.013939999975264072, 0.013923157006502151, 0.01388712041079998, 0.013850323855876923, 0.01375238224864006]
validation_loss: [0.02682528831064701, 0.023624813184142113, 0.022196508944034576, 0.021383153274655342, 0.02047845907509327, 0.02046382986009121, 0.01970459334552288, 0.01948031596839428, 0.019529853016138077, 0.01945362240076065, 0.018784986808896065, 0.01867593266069889, 0.018819749355316162, 0.01845351606607437, 0.018262263387441635, 0.018495583906769753, 0.018222326412796974, 0.018192127346992493, 0.01809854805469513, 0.017970753833651543, 0.01786850579082966, 0.018099607899785042, 0.01895921677350998, 0.01802244409918785, 0.017799999564886093, 0.01777777075767517, 0.017982112243771553, 0.01773381233215332, 0.017891261726617813, 0.017688419669866562, 0.017733415588736534, 0.018102360889315605, 0.017759356647729874, 0.01767406053841114, 0.017928805202245712, 0.017616569995880127, 0.017660070210695267, 0.017748236656188965, 0.017556486651301384, 0.017624767497181892, 0.017557242885231972, 0.01751563511788845, 0.017497334629297256, 0.017462747171521187, 0.017728066071867943, 0.01777365803718567, 0.01775866188108921, 0.018132975324988365, 0.017444713041186333, 0.017433268949389458]
