Model: "auto_encoder_3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_18 (Conv2D)          (None, 64, 64, 32)        2624      
                                                                 
 max_pooling2d_9 (MaxPoolin  (None, 32, 32, 32)        0         
 g2D)                                                            
                                                                 
 conv2d_19 (Conv2D)          (None, 32, 32, 64)        18496     
                                                                 
 max_pooling2d_10 (MaxPooli  (None, 16, 16, 64)        0         
 ng2D)                                                           
                                                                 
 dropout_6 (Dropout)         (None, 16, 16, 64)        0         
                                                                 
 conv2d_20 (Conv2D)          (None, 16, 16, 128)       73856     
                                                                 
 max_pooling2d_11 (MaxPooli  (None, 8, 8, 128)         0         
 ng2D)                                                           
                                                                 
 flatten_3 (Flatten)         (None, 8192)              0         
                                                                 
 dropout_7 (Dropout)         (None, 8192)              0         
                                                                 
 dense_9 (Dense)             (None, 512)               4194816   
                                                                 
 dropout_8 (Dropout)         multiple                  0 (unused)
                                                                 
 dense_10 (Dense)            (None, 128)               65664     
                                                                 
 dropout_9 (Dropout)         multiple                  0 (unused)
                                                                 
 dense_11 (Dense)            (None, 512)               66048     
                                                                 
 reshape_3 (Reshape)         (None, 4, 4, 32)          0         
                                                                 
 up_sampling2d_9 (UpSamplin  (None, 8, 8, 32)          0         
 g2D)                                                            
                                                                 
 conv2d_21 (Conv2D)          (None, 8, 8, 128)         36992     
                                                                 
 dropout_10 (Dropout)        (None, 8, 8, 128)         0         
                                                                 
 up_sampling2d_10 (UpSampli  (None, 16, 16, 128)       0         
 ng2D)                                                           
                                                                 
 conv2d_22 (Conv2D)          (None, 16, 16, 64)        73792     
                                                                 
 dropout_11 (Dropout)        (None, 16, 16, 64)        0         
                                                                 
 up_sampling2d_11 (UpSampli  (None, 32, 32, 64)        0         
 ng2D)                                                           
                                                                 
 conv2d_23 (Conv2D)          (None, 32, 32, 32)        18464     
                                                                 
 conv2d_transpose_3 (Conv2D  (None, 64, 64, 7)         2023      
 Transpose)                                                      
                                                                 
=================================================================
Total params: 4552775 (17.37 MB)
Trainable params: 4552775 (17.37 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

charset_in: AaOoUu8Bj
charset_out: ÄäÖöÜüß
box_size: 64
test_size: 0.1
batch_size: 32
training_loss: [0.03239692375063896, 0.02552672289311886, 0.023665932938456535, 0.02256501279771328, 0.021774832159280777, 0.02123270370066166, 0.020721111446619034, 0.02045523189008236, 0.020155154168605804, 0.01987602934241295, 0.019567586481571198, 0.019419806078076363, 0.019237512722611427, 0.019074734300374985, 0.01887696236371994, 0.01877632550895214, 0.018644364550709724, 0.018542276695370674, 0.0184065792709589, 0.018360186368227005, 0.0182863250374794, 0.018182871863245964, 0.018082503229379654, 0.018044739961624146, 0.01795366406440735, 0.017871031537652016, 0.01780032366514206, 0.017710743471980095, 0.017702840268611908, 0.017640147358179092, 0.017563985660672188, 0.01750931888818741, 0.017456671223044395, 0.01745494268834591, 0.017385441809892654, 0.01733100228011608, 0.017271310091018677, 0.017236139625310898, 0.017238223925232887, 0.017178697511553764, 0.017124734818935394, 0.017092425376176834, 0.017088552936911583, 0.017006052657961845, 0.01698143035173416, 0.01698109321296215, 0.016931267455220222, 0.01691543310880661, 0.016898686066269875, 0.016850357875227928]
validation_loss: [0.02700909972190857, 0.0235842727124691, 0.022718103602528572, 0.022103238850831985, 0.021813591942191124, 0.0204797200858593, 0.02097976766526699, 0.020040327683091164, 0.020372707396745682, 0.01959570124745369, 0.019458534196019173, 0.019124016165733337, 0.01933956891298294, 0.019138608127832413, 0.01886199787259102, 0.01890840008854866, 0.01898747868835926, 0.018950117751955986, 0.01853887550532818, 0.018824756145477295, 0.0185130275785923, 0.018526166677474976, 0.018770180642604828, 0.018570253625512123, 0.01826980523765087, 0.018254637718200684, 0.018183011561632156, 0.018201952800154686, 0.018254276365041733, 0.018351145088672638, 0.018107028678059578, 0.018067095428705215, 0.018038716167211533, 0.017943797633051872, 0.0180637389421463, 0.017919249832630157, 0.01795475371181965, 0.01788235269486904, 0.018012655898928642, 0.017816957086324692, 0.01795049011707306, 0.017877155914902687, 0.017860617488622665, 0.01790362223982811, 0.017843622714281082, 0.017824705690145493, 0.018039599061012268, 0.017844563350081444, 0.01782217249274254, 0.01780177466571331]
