Model: "variational_auto_encoder_3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_15 (Conv2D)          (None, 64, 64, 32)        2624      
                                                                 
 max_pooling2d_9 (MaxPoolin  (None, 32, 32, 32)        0         
 g2D)                                                            
                                                                 
 conv2d_16 (Conv2D)          (None, 32, 32, 64)        18496     
                                                                 
 max_pooling2d_10 (MaxPooli  (None, 16, 16, 64)        0         
 ng2D)                                                           
                                                                 
 conv2d_17 (Conv2D)          (None, 16, 16, 128)       73856     
                                                                 
 max_pooling2d_11 (MaxPooli  (None, 8, 8, 128)         0         
 ng2D)                                                           
                                                                 
 flatten_3 (Flatten)         (None, 8192)              0         
                                                                 
 dense_14 (Dense)            (None, 512)               4194816   
                                                                 
 dense_15 (Dense)            (None, 8)                 4104      
                                                                 
 dense_16 (Dense)            (None, 8)                 72        
                                                                 
 dense_17 (Dense)            multiple                  0 (unused)
                                                                 
 sampling_2 (Sampling)       (None, 8)                 0         
                                                                 
 dense_18 (Dense)            (None, 512)               4608      
                                                                 
 reshape_2 (Reshape)         (None, 4, 4, 32)          0         
                                                                 
 up_sampling2d_6 (UpSamplin  (None, 8, 8, 32)          0         
 g2D)                                                            
                                                                 
 conv2d_18 (Conv2D)          (None, 8, 8, 128)         36992     
                                                                 
 up_sampling2d_7 (UpSamplin  (None, 16, 16, 128)       0         
 g2D)                                                            
                                                                 
 conv2d_19 (Conv2D)          (None, 16, 16, 64)        73792     
                                                                 
 up_sampling2d_8 (UpSamplin  (None, 32, 32, 64)        0         
 g2D)                                                            
                                                                 
 conv2d_20 (Conv2D)          (None, 32, 32, 32)        18464     
                                                                 
 conv2d_transpose_2 (Conv2D  (None, 64, 64, 7)         2023      
 Transpose)                                                      
                                                                 
=================================================================
Total params: 4429853 (16.90 MB)
Trainable params: 4429847 (16.90 MB)
Non-trainable params: 6 (24.00 Byte)
_________________________________________________________________

charset_in: AaOoUu8Bj
charset_out: ÄäÖöÜüß
box_size: 64
test_size: 0.1
batch_size: 32
training_loss: [880.5433349609375, 644.8336181640625, 602.3389892578125, 604.314697265625, 586.3863525390625, 573.3036499023438, 608.8573608398438, 581.4940185546875, 570.5744018554688, 572.2349853515625, 581.948486328125, 587.6521606445312, 604.1859130859375, 585.1454467773438, 565.7184448242188, 565.6231689453125, 569.9409790039062, 575.896484375, 562.9951782226562, 573.2208251953125, 568.11572265625, 551.519287109375, 556.4960327148438, 568.0565795898438, 562.6156005859375, 595.957763671875, 574.0916137695312, 560.2131958007812, 581.8233642578125, 568.4046630859375, 584.1806640625, 563.0249633789062, 558.2870483398438, 575.7085571289062, 559.2955932617188, 547.7626953125, 549.5477905273438, 566.0169677734375, 549.458740234375, 544.2613525390625, 537.9476318359375, 558.22021484375, 546.9363403320312, 548.3119506835938, 540.9140014648438, 553.798095703125, 555.8492431640625, 547.044921875, 540.8264770507812, 541.9378051757812, 555.3047485351562, 540.2872314453125, 544.3055419921875, 566.6461181640625, 560.6298828125, 554.4193115234375, 552.4730224609375, 555.8740844726562, 541.9878540039062, 539.4515991210938, 532.7990112304688, 534.0108032226562, 539.0005493164062, 533.6918334960938, 542.732177734375, 534.2119140625, 535.4092407226562, 559.380859375, 535.2723999023438, 533.8928833007812, 535.4988403320312, 532.7963256835938, 540.7825927734375, 528.8136596679688, 531.3465576171875, 531.880859375, 527.2793579101562, 539.8129272460938, 541.2669067382812, 533.623291015625, 529.9330444335938, 524.7427368164062, 524.1690673828125, 521.1968994140625, 525.5595092773438, 524.8405151367188, 547.37451171875, 557.4656372070312, 533.11962890625, 530.51806640625, 539.0028076171875, 525.6211547851562, 527.779296875, 531.4168090820312, 523.962158203125, 522.8388671875, 520.5928344726562, 530.2188110351562, 527.5913696289062, 531.5889282226562]
